{
    "COSC 501": "Designed for graduate students to provide them with the necessary background in data structures and algorithm analysis. Topics include: objects and abstract data types, dynamic variables and pointers, recursion, sort and search, algorithms, linear and non-linear structures such as linked lists, trees and graphs, hashing, algorithms time complexity analysis, object-oriented design and programming. Graded S/U. Prerequisites: None. Prerequisites: None. Prerequisites: Admission to COSC MS program.",
    "COSC 502": "Computer organization and architecture including computer arithmetic, digital logic, assembly language, memory system organization, and computer interfacing. This course is a preparatory course for the Masters in Computer Science Program and has S/U grading. Prerequisites: None. Prerequisites: None. Prerequisites: Degree-seeking status.",
    "COSC 519": "An overview of the principles of operating systems. Topics include multiple processes, process synchronization and intercommunication, resource allocation, memory management, processor scheduling and I/O device management. Prerequisites: None. Prerequisites: None. Prerequisites: Admission to the MS in Computer Science or Information Technology PhD program.",
    "COSC 571": "Computer system performance evaluation methodologies, techniques and tools including different types of monitors as a measurement tool, workload characterization, important performance indices, analytic modeling with particular emphasis on the application of the operational queuing network modeling techniques to performance analysis and technical aspects of computer selection. Prerequisites: None. Prerequisites: None. Prerequisites: COSC 519; or admission to the Information Technology PhD program.",
    "COSC 578": "Build theoretical foundation for database management systems, study different database models, relational algebra, relational calculus, SQL, ER, EER models, structured query formulations, database design, analysis and modeling, functional dependencies and normalization, and overview of next generation database management systems. Prerequisites: None. Prerequisites: None. Prerequisites: Admission to the MS in Computer Science or Information Technology PhD program.",
    "COSC 581": "A survey of the problems and techniques involved in producing or modeling intelligence in computers. Particular emphasis will be placed on representation of knowledge and basic paradigms of problem solving. Topics include game playing, theorem proving, natural language and learning systems. Prerequisites: None. Prerequisites: None. Prerequisites: Admission to the MS in Computer Science or Information Technology PhD program.",
    "COSC 583": "Algorithm design such as heuristics, backtrack programming, branch and bound, recursion, simulation and conquer, balancing and dynamic programming. Efficiency of algorithms-NP-complete problems. Prerequisites: None. Prerequisites: None. Prerequisites: Admission to the MS in Computer Science or Information Technology PhD program.",
    "COSC 600": "Data abstraction, linear data structures, file organization and access methods, memory management, advanced internal and external sort and search algorithms and the trade-offs involved in the use of different data organization. Prerequisites: None. Prerequisites: None. Prerequisites: Admission to the MS in Computer Science or Information Technology PhD program.",
    "COSC 601": "Introduces the basic concepts and principles of software requirements engineering, and is designed to expose student to common tools and techniques, established methods for modeling software systems and various approaches to requirements engineering (structured, object oriented and formal). Intends to cover in its entirety the process of requirements engineering. Prerequisites: None. Prerequisites: None. Prerequisites: AIT 624/COSC 612-Software Engineering; or admission to the Information Technology PhD program.",
    "COSC 611": "Continuous and discrete event systems simulation application, implementation, role of modeling and languages, experimental design, data collection, verification, validation, object-oriented simulation, random variable generation, Monte Carlo methods for performance evaluation, sensitivity analysis and optimization. Prerequisites: None. Prerequisites: None. Prerequisites: Admission to the MS in Computer Science or Information Technology PhD program.",
    "COSC 612": "Formal software engineering principles and practices and their application to the development of computer-based systems. Prerequisites: None. Prerequisites: None. Prerequisites: Admission to the MS in Computer Science or Information Technology PhD program.",
    "COSC 614": "Formal process leading to requirements, design and test specifications, quantitative measures of useful software parameters, review of software systems components and complete design and test processes. Prerequisites: None. Prerequisites: None. Prerequisites: COSC 612; or admission to the Information Technology PhD program.",
    "COSC 617": "Design and implementation of distributed information systems involving the technologies developed for the World Wide Web (WWW). Emphasis will be given to server architectures, database connectivity and the enterprise packages provided by web development languages. Prerequisites: None. Prerequisites: None. Prerequisites: COSC 600 and COSC 457/COSC 578; or admission to the Information Technology PhD program.",
    "COSC 618": "Provides a set of latest approaches in designing IT infrastructures aligning them with enterprise business activities at the architectural level, including business architecture, information architecture, solution architecture, and technology architecture. Prerequisites: None. Prerequisites: None. Prerequisites: AIT 624 or COSC 612; or admission to the Information Technology PhD program.",
    "COSC 638": "Design principles for multiprocessor and RISC machines, comparison between RISC and CISC architectures, multiprocessor interconnection networks, memory organizations, parallel algorithms for sorting, image processing, FFT and various applications, data flow computers and VLST computations. Prerequisites: None. Prerequisites: None. Prerequisites: Admission to the MS in Computer Science or Information Technology PhD program.",
    "COSC 639": "Implementation of operating systems for online multiprogramming environment. Primary and secondary storage management techniques, file security, data integrity and a detailed study of operating systems such as UNIX. Prerequisites: None. Prerequisites: None. Prerequisites: COSC 439/COSC 519 or equivalent; or admission to the Information Technology PhD program.",
    "COSC 641": "A broad overview and discussion of the technologies relevant to electronic commerce, including communication networks and the Internet, Web programming languages, computer security, electronic payments, multimedia databases and distributed transaction processing, and legal and ethical issues. Prerequisites: None. Prerequisites: None. Prerequisites: COSC 600; or admission to the Information Technology PhD program.",
    "COSC 643": "E-business strategies, Web-based system architecture, collaboration techniques among buyers and sellers. Focus on the technical aspects of supply chain management system, which include message passing framework, XML, DTD, XSL, XSLT, XPath, Web-based database manipulation, and VPN. Managerial aspects of e-business as well, including ERP systems. Prerequisites: None. Prerequisites: None. Prerequisites: COSC 600; or admission to the Information Technology PhD program.",
    "COSC 644": "Principles, mechanisms, and implementation of information assurance. Emphasis on human and technological aspects of information assurance and methods of dealing with risks. Prerequisites: None. Prerequisites: None. Prerequisites: COSC 600; or admission to the Information Technology PhD program.",
    "COSC 645": "A broad introduction to cryptography and its application to computer-network security services such as confidentiality, digital signature, access control, and electronic payments. Prerequisites: None. Prerequisites: None. Prerequisites: COSC 600; or admission to the Information Technology PhD program.",
    "COSC 647": "Security concepts in developing software applications, including design principles for secure development and security issues in programming languages, databases, and Web servers. Prerequisites: None. Prerequisites: None. Prerequisites: COSC 578 and COSC 600; or admission to the Information Technology PhD program.",
    "COSC 650": "Computer networking concepts and technologies, including architectures and protocols, LANs, Internet working, and applications. Prerequisites: None. Prerequisites: None. Prerequisites: Admission to the MS in Computer Science or Information Technology PhD program.",
    "COSC 657": "Advanced database systems including object-oriented databases, query optimization, concurrency, and data security. Prerequisites: None. Prerequisites: None. Prerequisites: COSC 457/COSC 578; or admission to the Information Technology PhD program.",
    "COSC 661": "Major differences between AI and conventional programming, including symbolic programming and adaptive systems. Languages like PROLOG and LISP will be introduced. Prerequisites: None. Prerequisites: None. Prerequisites: COSC 461/COSC 581; or admission to the Information Technology PhD program.",
    "COSC 665": "Approaches and methods for expert system design, including analysis, prototyping, and development. Prerequisites: None. Prerequisites: None. Prerequisites: COSC 581; or admission to the Information Technology PhD program.",
    "COSC 670": "Reading and study in selected topics in computer science with an emphasis on increased knowledge. A project or paper is required. Prerequisites: None. Prerequisites: None. Prerequisites: COSC 600; or admission to the Information Technology PhD program.",
    "COSC 680": "Presentation and discussion of research trends and advanced topics in computer science. Prerequisites: None. Prerequisites: None. Prerequisites: Consent of instructor.",
    "COSC 683": "Trends in designing algorithms for the Internet and security, including routing, compression, cryptology, and zero-knowledge protocols. Prerequisites: None. Prerequisites: None. Prerequisites: COSC 600; or admission to the Information Technology PhD program.",
    "COSC 685": "Explores risk assessment approaches for information systems, monitoring tools, and security frameworks. Prerequisites: None. Prerequisites: None. Prerequisites: COSC 600 or AIT 500; or admission to the Information Technology PhD program.",
    "COSC 686": "Concepts of computer graphics including affine geometry, shading, rendering, texture mapping, and ray tracing. Prerequisites: None. Prerequisites: None. Prerequisites: Admission to the MS in Computer Science or Information Technology PhD program.",
    "COSC 695": "Independent study in selected areas of computer science. Prerequisites: None. Prerequisites: None. Prerequisites: 9 units at the graduate or upper-division level; and consent of instructor.",
    "COSC 697": "Opportunity to work in a computing facility under supervision of faculty and industry professionals. Prerequisites: None. Prerequisites: None. Prerequisites: Minimum 18 hours of graduate courses, GPA of 3.0+, and consent of Program Director.",
    "COSC 710": "Concepts and hands-on techniques for analyzing large-scale social networks. Prerequisites: None. Prerequisites: None. Prerequisites: COSC 600; or admission to the Information Technology PhD program.",
    "COSC 715": "Physical mechanisms of robotics, issues of modeling, planning control and programming. Principles underlying the design and analysis of robotic systems. Prerequisites: None. Prerequisites: None. Prerequisites: COSC 600; or admission to the Information Technology PhD program.",
    "COSC 716": "Object-oriented approach to modeling, problem solving, requirement analysis, system design, system implementation, database design, system engineering and software engineering. Prerequisites: None. Prerequisites: None. Prerequisites: COSC 600; or admission to the Information Technology PhD program.",
    "COSC 725": "Analog to digital and digital to analog conversions, signal conditioning and processing, adaptive control of nonlinear systems and real-time programming considerations. Prerequisites: None. Prerequisites: None. Prerequisites: A course in computer architecture; or admission to the Information Technology PhD program.",
    "COSC 732": "Principles and practice of wireless networks and mobile communications, including cellular systems, satellite networks, wireless LANs, and mobile IP. Prerequisites: None. Prerequisites: None. Prerequisites: COSC 650; or admission to the Information Technology PhD program.",
    "COSC 734": "Principles and practice of network security, covering authentication services, IP security, Web security, wireless security, and system threats. Prerequisites: None. Prerequisites: None. Prerequisites: COSC 650; or admission to the Information Technology PhD program.",
    "COSC 735": "Advanced networking topics including network design, threats, sensor/actor networks, and cyber-physical systems. Prerequisites: None. Prerequisites: None. Prerequisites: COSC 650; or admission to the Information Technology PhD program.",
    "COSC 740": "Parallel computing concepts including matrix algorithms, parallel programming, and optimization algorithms for sorting and searching. Prerequisites: None. Prerequisites: None. Prerequisites: COSC 600 or equivalent and a course in linear algebra; or admission to the Information Technology PhD program.",
    "COSC 741": "Key elements of E-commerce, system analysis, and B2B projects. Students analyze and implement parts of an E-business model. Prerequisites: None. Prerequisites: None. Prerequisites: COSC 641; or admission to the Information Technology PhD program.",
    "COSC 745": "In-depth study of computer security, including firewalls, intrusion detection, denial-of-service attacks, and mobile security. Prerequisites: None. Prerequisites: None. Prerequisites: COSC 645; or admission to the Information Technology PhD program.",
    "COSC 750": "Neural network and deep learning methods such as CNNs, RNNs, autoencoders, generative models, and LSTM. Prerequisites: None. Prerequisites: None. Prerequisites: COSC 600 and COSC 757; or admission to the Information Technology PhD program.",
    "COSC 757": "Introduction to data mining techniques and tools, with real-world applications such as Web mining. Prerequisites: None. Prerequisites: None. Prerequisites: COSC 578; or admission to the Information Technology PhD program.",
    "COSC 760": "Study and practice of big data analytics, using frameworks like Hadoop, Spark, and NoSQL databases. Prerequisites: None. Prerequisites: None. Prerequisites: COSC 578; or admission to the Information Technology PhD program.",
    "COSC 795": "Students share and discuss research findings in information technology. Repeatable for up to 3 credits. Prerequisites: None. Prerequisites: None. Prerequisites: N/A.",
    "COSC 880": "Conduct advanced studies or real-world application implementation. Graded S/U. Prerequisites: None. Prerequisites: None. Prerequisites: Completion of at least 18 graduate credits towards the M.S. in Computer Science.",
    "COSC 885": "Continuation of previously started project work. Prerequisites: None. Prerequisites: None. Prerequisites: Previous registration for project work.",
    "COSC 897": "Original research investigation using acceptable methods and design. Prerequisites: None. Prerequisites: None. Prerequisites: Completion of at least 21 graduate credits toward an M.S. degree in Computer Science.",
    "COSC 898": "A continuation of COSC 897, taken over two semesters. Graded S/U. Prerequisites: None. Prerequisites: None. Prerequisites: Previous registration for COSC 897.",
    "COSC 899": "Continuation of graduate thesis with satisfactory progress. Graded S/U. Prerequisites: None. Prerequisites: None. Prerequisites: Previous registration for graduate thesis.",
    "COSC 109": "Creative activities involving symbolic manipulation and computer graphics; animation, dynamic story telling, computer music, visual effects, Web publishing, computer games, artwork and multimedia. Additional laboratory time required. Core: Creativity & Creative Development. Prerequisites: None. Prerequisites: None. Prerequisites: None.",
    "COSC 111": "Retrieve, process, classify, sort and evaluate data and information. Problem solving techniques, creative thinking skills, communication skills, team building, and professional ethics. Laboratories covering the Internet, spreadsheets, and databases. Additional laboratory time required. Students cannot earn credit for both this course and IDNM 101. Prerequisites: None. Prerequisites: None. Prerequisites: None.",
    "COSC 175": "Computer systems overview, algorithm development, data representation, software design and testing methodologies, and brief overview of advanced topics. Prerequisites: None. Prerequisites: None. Prerequisites: None.",
    "COSC 236": "Introduction to structured problem-solving, algorithm development and computer programming. Three lecture hours and two laboratory hours. Prerequisites: None. Prerequisites: None. Prerequisites: COSC 175 and at least one of [MATH 115, MATH 117, MATH 119, MATH 211, (MATH 231 or ECON 205), MATH 273, MATH 274, MATH 275, or a qualifying score on the Math Placement Exam]..",
    "COSC 237": "Development of programming and problem-solving skills, with a focus on object-oriented programming and design. Students will design and develop programs using encapsulation and information hiding, inheritance, polymorphism, and generics. Introduction to data structures and their implementations (lists, stacks, queues, and trees), recursion, and searching and sorting algorithms. Includes two laboratory hours per week. Prerequisites: None. Prerequisites: None. Prerequisites: COSC 236; MATH 211 or MATH 273..",
    "COSC 290": "Computer organization and architecture including computer arithmetic, digital logic, principles of assembly language, memory system organization, computer interfacing, CISC and RISC architecture. Three hours per week of laboratory work required. Prerequisites: None. Prerequisites: None. Prerequisites: COSC 236 and (MATH 263 or MATH 267)..",
    "COSC 310": "Advanced programming concepts within the context of a specific programming language for computer science and related majors. The course may be repeated up to 6 units when a different programming language is offered. Programming languages offered may include C, C++, C#, Python, Ruby, and others. Prerequisites: None. Prerequisites: None. Prerequisites: COSC 237 and COSC 290..",
    "COSC 311": "Foundations and impacts of computing and digital technologies, including history, applications, and societal impacts. Prerequisites: None. Prerequisites: None. Prerequisites: Junior status and two science courses or one math course and one science course..",
    "COSC 314": "A broad introduction to cryptography and its mathematical foundations, including applications to computer-network security services and mechanisms (confidentiality, integrity, authentication, electronic case and others) and to various protocols in distributed computation. Prerequisites: None. Prerequisites: None. Prerequisites: COSC 236; either MATH 263 or MATH 267; and either MATH 330 or MATH 331 (may be taken concurrently)..",
    "COSC 321": "Computer technology and its social and economic impacts on organizations and individuals. Prerequisites: None. Prerequisites: None. Prerequisites: Junior/senior status and completion of two science courses or one math and one science course..",
    "COSC 336": "Fundamental data structures used in programming and the basic techniques used to design and analyze algorithms. Topics include: complexity analysis of elementary algorithms, linear data structures, trees, heaps, graphs, search algorithms (balanced binary trees, B-trees, hashing), sorting algorithms, basic graph algorithms (graph traversal, topological sorting, shortest path, minimum spanning trees), and paradigms in the design of algorithms (divide and conquer, dynamic programming, greedy). Prerequisites: None. Prerequisites: None. Prerequisites: COSC 237 and MATH 274..",
    "COSC 340": "Covers the underlying concepts underlying all computer systems and introduces the student to the low-level abstraction of a computer system from a programmer's point of view, with an emphasis on low-level Assembly and C programming. Topics include data representation, 32-bit vs. 64-bit implementation, device driver development, the process of compiling and linking, low-level memory management and basic processor architecture. Prerequisites: None. Prerequisites: None. Prerequisites: COSC 237 and COSC 290; major standing..",
    "COSC 350": "Network architecture and protocols, data communications, LANs and cellular networks, forwarding and routing, TCP/IP suite, network programming and packet analysis. Prerequisites: None. Prerequisites: None. Prerequisites: COSC 290..",
    "COSC 397": "Students work in local computing facility under on-site and faculty supervision. May be repeated for a maximum of 6 units. Only 3 units can be applied to the major. Minimum of 2.75 GPA. Graded S/U. Prerequisites: None. Prerequisites: None. Prerequisites: COSC 336 and consent of the internship coordinator..",
    "COSC 412": "Methodology of designing and programming for a wide area of applications with a high degree of modifiability, efficiency, reliability, and understanding. Prerequisites: None. Prerequisites: None. Prerequisites: COSC 336..",
    "COSC 417": "A general introduction to the theory of computation, including finite automata, compatibility, formal languages and their relation to automata, algorithms, and algorithmic complexity. The major emphasis will be on developing formal descriptions of computers and computational processes, and practical implications of theoretical results. Prerequisites: None. Prerequisites: None. Prerequisites: COSC 336..",
    "COSC 418": "Ethical questions and societal concerns related to the widespread use of computers and the resulting responsibilities of computer scientists. Prerequisites: None. Prerequisites: None. Prerequisites: Junior/senior standing; ENGL 317 or BUSX 301; must have previously taken a computing class..",
    "COSC 431": "Independent studies in selected areas of computer science. A maximum of 4 units may be earned in selected topics. Prerequisites: None. Prerequisites: None. Prerequisites: Consent of the instructor and 9 units of computer science..",
    "COSC 432": "Introduces the basic concepts as well as the principles of software requirements development. Students will learn how to elicit, analyze, and model requirements and gain practical knowledge of tools and techniques related to these requirements activities. Develops theoretical knowledge and practitioner skills critical for real world applications. Prerequisites: None. Prerequisites: None. Prerequisites: COSC 412..",
    "COSC 435": "A comprehensive, hands-on study of the design and creation of mobile applications using modern development environments and tools. Topics include mobile device architecture, event-handlers, location-based services, onboard mobile device sensors, programming languages, software engineering, user interface design, and mobile application distribution. Prerequisites: None. Prerequisites: None. Prerequisites: COSC 336..",
    "COSC 436": "Introduction to object-oriented design and programming technology (OOD/OOP). Main phases in object-oriented design and techniques in object-oriented programming. Programming language design and implementation issues for object-oriented languages. Prerequisites: None. Prerequisites: None. Prerequisites: COSC 336..",
    "COSC 439": "Operating systems as resource managers with emphasis on file processor, memory and device management and processes. Design and implementation of a simulated multiprogramming operating system. Prerequisites: None. Prerequisites: None. Prerequisites: COSC 336..",
    "COSC 440": "An in-depth discussion of security concepts in operating systems. This course examines some of the security issues in current operating systems and discusses the existing tools and technologies for setting up a secure system. Prerequisites: None. Prerequisites: None. Prerequisites: COSC 439..",
    "COSC 442": "A comprehensive study of concepts, techniques, and tools for software quality assurance and testing. Software testing at the unit, subsystem and system levels; test models and test design techniques; integration, regression, and system testing methods; static and dynamic analysis; security and reliability testing and assessment. Prerequisites: None. Prerequisites: None. Prerequisites: COSC 412..",
    "COSC 450": "Network security principles and applications, including authentication applications. IP security, Web security, network management security, wireless security and system security. Prerequisites: None. Prerequisites: None. Prerequisites: MATH 314 and COSC 350..",
    "COSC 455": "Underlying concepts in high-level programming languages and techniques for their implementation, a survey of a selected group of such languages along with a discussion of the interrelationship between programming and programming languages. Prerequisites: None. Prerequisites: None. Prerequisites: COSC 336..",
    "COSC 457": "Data models and sublanguages; security and integrity problems; functions of the database administrator; implementation and use of a database management system; a comparison of widely used DBMS packages. Prerequisites: None. Prerequisites: None. Prerequisites: COSC 336..",
    "COSC 458": "A study of security concepts in developing software applications. Discusses design principles for secure software development, and some of the security issues in current programming and scripting languages, database systems and Web servers. Prerequisites: None. Prerequisites: None. Prerequisites: COSC 340 and COSC 455 and COSC 457 (COSC 457 may be taken concurrently)..",
    "COSC 459": "Simulation models and languages, data collection and output analysis, random number generation and Monte Carlo integration, model verification and validation, variance reduction techniques, optimization, the implementation and use of simulation techniques in problem solving. Prerequisites: None. Prerequisites: None. Prerequisites: COSC 336 and MATH 330..",
    "COSC 461": "A survey of the problems and techniques involved in producing or modeling intelligence in computers. Particular emphasis will be placed on representation of knowledge and basic paradigms of problem solving. Topics include game playing, theorem proving, natural language, and learning systems. Prerequisites: None. Prerequisites: None. Prerequisites: COSC 336..",
    "COSC 465": "Physical mechanisms of robotics, issues of modeling, planning control and programming. Principles underlying the design and analysis of robotic systems, with emphasis on the autonomous, and behavior-based systems. Prerequisites: None. Prerequisites: None. Prerequisites: COSC 336..",
    "COSC 467": "A comprehensive, hands-on study of the techniques and tools in the field of data mining and knowledge discovery in data (KDD). The foundations of data mining from a number of perspectives are covered, including exploratory analysis, classification, and/or cluster analysis. Prerequisites: None. Prerequisites: None. Prerequisites: COSC 457..",
    "COSC 471": "An introduction to the field of computer generated and/or displayed graphics data. Covers the topics of representation, transformations, curve and 3-D problems, graphics hardware, and programming considerations. Prerequisites: None. Prerequisites: None. Prerequisites: COSC 336..",
    "COSC 481": "An in-depth study of the practical aspects of computer security, including the study of common computer security vulnerabilities in a laboratory setting. Prerequisites: None. Prerequisites: None. Prerequisites: COSC 440 and COSC 450..",
    "COSC 482": "Best practices for teaching computer science at the secondary level, including the design of learning environments that promote effective teaching and learning in computer science classrooms; the development of lesson and unit plans to include real-world computing problems and project-based methodologies; and consideration of how to teach key computer programming concepts, data abstraction, and physical computing. Prerequisites: None. Prerequisites: None. Prerequisites: Consent of department..",
    "COSC 483": "Algorithm design methods such as heuristics, backtrack programming, branch and bound, recursion, simulation, divide-and-conquer, balancing, and dynamic programming. Efficiency of algorithms - NP-complete problems. Prerequisites: None. Prerequisites: None. Prerequisites: COSC 336..",
    "COSC 484": "Applications executing on a client-server system, emphasizing client side. Technologies include HTTP protocol, dynamic HTML, server-side programming, and client-side JavaScript libraries & frameworks. Prerequisites: None. Prerequisites: None. Prerequisites: COSC 336..",
    "COSC 485": "Provides students with effective conceptual as well as hands-on knowledge in the areas of Reverse Engineering and Malware Analysis. It follows a progressive approach that introduces relevant concepts and techniques while preparing students to become effective reverse engineering and malware analysts able to use standard methodologies for detecting, analyzing, reverse engineering and eradicating malware in computing systems. Prerequisites: None. Prerequisites: None. Prerequisites: COSC 340; COSC 450..",
    "COSC 490": "A project-based course for computer science majors that provides students with the experience of working as part of a project team using current software design and development tools and environments. Projects will consist of all aspects of software development, including requirements analysis, design, and implementation. Prerequisites: None. Prerequisites: None. Prerequisites: COSC 412; software engineering track majors only (or by department permission); senior standing..",
    "COSC 492": "Internship in public school classrooms under the guidance of a university supervisor. Graded S/U. Prerequisites: None. Prerequisites: None. Prerequisites: COSC 482, SEMS 498, and consent of COSC department and Towson UTeach..",
    "COSC 493": "Individual readings and background research, under the direction of a faculty member, in preparation for writing an honors thesis. (Restricted to students in the departmental honors program). Prerequisites: None. Prerequisites: None. Prerequisites: Admission to the departmental honors program..",
    "COSC 495": "Directed study in selected areas of Computer Science for which there is no regular course offered. The use of a proposal and well-defined objectives as well as a formal paper or project report are required. Prerequisites: None. Prerequisites: None. Prerequisites: Senior standing in Computer Science and consent of instructor.."
}